m-gardet/STM32F3DISCOVERY/Src/command.c
/*
 * command.c
 *
 *  Created on: 28 août 2016
 *      Author: mick
 */



#include "FreeRTOS.h"
#include "task.h"
#include "cmsis_os.h"
#include "queue.h"
#include "usbQueue.h"
#include "usbd_cdc_if.h"
#include <stdio.h>
#include "stm32f3xx_hal_gpio.h"
#include "flash.h"
#include "iwdg.h"
#include "adc.h"

#define VERSION "1.0.1"

#define END_OF_LINE "\n\r"

#define OS_WAITE_TIMEOUT 1000 // in ms

const char RESERVED_PIN[][5] =
{
  //PINs    FUNCTIONs     LABELs
  "PE02",// GPIO_EXTI2      DRDY      [LSM303DLHC_DRDY]
  "PE03",// GPIO_Output     CS_I2C/SPI    [L3GD20_CS_I2C/SPI]
  "PE04",// GPIO_EXTI4      MEMS_INT3     [LSM303DLHC_INT1]
  "PE05",// GPIO_EXTI5      MEMS_INT4     [LSM303DLHC_INT2]
  "PC14",// OSC32_IN      RCC_OSC32_IN  OSC32_IN
  "PC15",// OSC32_OUT     RCC_OSC32_OUT OSC32_OUT
  "PF00",// OSC_IN        RCC_OSC_IN    OSC_IN
  "PF01",// OSC_OUT       RCC_OSC_OUT   OSC_OUT
  "PA00",// GPIO_Input      B1        [Blue PushButton]
  "PA04",// DAC_OUT1      DAC
  "PA05",// SPI1_SCK      SPI1_SCK    [L3GD20_SCL/SPC]
  "PA06",// SPI1_MISO     SPI1_MISO     [L3GD20_SA0/SDO]
  "PA07",// SPI1_MOSI     SPI1_MISO     [L3GD20_SDA/SDI/SDO]
  /*
  "PE08",// GPIO_Output     LD4       [Blue Led]
  */
  "PE09",// GPIO_Output     LD3       [Red Led]
  /*
  "PE10",// GPIO_Output     LD5       [Orange Led]
  "PE11",// GPIO_Output     LD7       [Green Led]
  "PE12",// GPIO_Output     LD9       [Blue Led]
  "PE13",// GPIO_Output     LD10      [Red Led]
  "PE14",// GPIO_Output     LD8       [Orange Led]
  "PE15",// GPIO_Output     LD6       [Green Led]
  */
  "PA11",// USB_DM        DM
  "PA12",// USB_DP        DP
  "PA13",// SYS_JTMS-SWDIO    SWDIO
  "PA14",// SYS_JTCK-SWCLK    SWCLK
  "PB03",// SYS_JTDO-TRACESWO SWO
  "PB06",// I2C1_SCL      I2C1_SCL [LSM303DLHC_SCL]
  "PB07",// I2C1_SDA      I2C1_SDA [LSM303DLHC_SDA]
  "PE00",// GPIO_EXTI0      MEMS_INT1 [L3GD20_INT1]
  "PE01",// GPIO_EXTI1      MEMS_INT2 [L3GD20_DRDY/INT2]
  // end
  "\0"
};

typedef struct
{
  const uint8_t name[5];
  uint32_t channel;
} adc_st;


adc_st adc_chanel [6] =
{
  { "PC00" , ADC_CHANNEL_6  },
  { "PC01" , ADC_CHANNEL_7  },
  { "PC02" , ADC_CHANNEL_8  },
  { "PC03" , ADC_CHANNEL_9  },
  { "PF02" , ADC_CHANNEL_10 },
  // end
  { "\0"  , 0 }

};


typedef struct
{
  const uint8_t name[5];
  uint8_t mode;
  uint8_t pull;
  uint8_t state;
} gpio_st;


#define NUMBER_OF_GPIO 64
#define INTEGRITY_NAME "ZZZZ"
typedef struct
{
  char sys_name[50];
  gpio_st gpio[NUMBER_OF_GPIO];
  char integrity_name[5];
} config_st;


const config_st default_config =
{
  {
    "IO Demo"
  },
  {
    //{ "PA00" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, [Blue PushButton]
    { "PA01" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PA02" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PA03" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    //{ "PA04" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, DAC
    //{ "PA05" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, L3GD20_SCL/SPC
    //{ "PA06" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, L3GD20_SA0/SDO
    //{ "PA07" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, L3GD20_SDA/SDI/SDO
    { "PA08" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PA09" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PA10" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    //{ "PA11" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, USB_DM
    //{ "PA12" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, USB_DP
    //{ "PA13" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, SYS_JTMS
    //{ "PA14" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, SYS_JTCK
    { "PA15" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB00" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB01" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB02" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    //{ "PB03" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, SYS_JTDO-TRACESWO
    { "PB04" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB05" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    //{ "PB06" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, LSM303DLHC_SCL
    //{ "PB07" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, LSM303DLHC_SDA

    { "PB08" , GPIO_MODE_OUTPUT_PP , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB09" , GPIO_MODE_OUTPUT_PP , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB10" , GPIO_MODE_OUTPUT_PP , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB11" , GPIO_MODE_OUTPUT_PP , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB12" , GPIO_MODE_OUTPUT_PP , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB13" , GPIO_MODE_OUTPUT_PP , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB14" , GPIO_MODE_OUTPUT_PP , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PB15" , GPIO_MODE_OUTPUT_PP , GPIO_NOPULL , GPIO_PIN_RESET },

    { "PC00" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC01" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC02" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC03" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC04" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC05" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC06" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC07" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC08" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC09" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC10" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC11" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PC12" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },

    /* The speed should not exceed 2 MHz with a maximu These GPIOs must not be used as current sources (3 mA)
        { "PC13" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
        { "PC14" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, // OSC32_IN
        { "PC15" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, // OSC32_OUT
    */
    { "PD00" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD01" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD02" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD03" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD04" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD05" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD06" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD07" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD08" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD09" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD10" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD11" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD12" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD13" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD14" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PD15" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },

    //{ "PE00" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, L3GD20_INT1
    //{ "PE01" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, L3GD20_DRDY/INT2
    //{ "PE02" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, LSM303DLHC_DRDY
    //{ "PE03" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, L3GD20_CS_I2C/SPI
    //{ "PE04" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, LSM303DLHC_INT1
    //{ "PE05" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, LSM303DLHC_INT2

    // PE8 - PE15 => LED
    { "PE06" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PE07" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PE08" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    //{ "PE09" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PE10" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PE11" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PE12" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PE13" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PE14" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PE15" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    //{ "PF00" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, //OSC_IN
    //{ "PF01" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }, //OSC_OUT
    { "PF02" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PF04" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PF06" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PF09" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    { "PF10" , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET },
    // end
    { "\0"   , GPIO_MODE_INPUT , GPIO_NOPULL , GPIO_PIN_RESET }
  },
  {INTEGRITY_NAME}
};

config_st config;


