m-gardet/STM32F3DISCOVERY/Src/command.c
    case 4 :
      *pin = GPIO_PIN_4;
      break;

    case 5 :
      *pin = GPIO_PIN_5;
      break;

    case 6 :
      *pin = GPIO_PIN_6;
      break;

    case 7 :
      *pin = GPIO_PIN_7;
      break;

    case 8 :
      *pin = GPIO_PIN_8;
      break;

    case 9 :
      *pin = GPIO_PIN_9;
      break;

    case 10:
      *pin = GPIO_PIN_10;
      break;

    case 11:
      *pin = GPIO_PIN_11;
      break;

    case 12:
      *pin = GPIO_PIN_12;
      break;

    case 13:
      *pin = GPIO_PIN_13;
      break;

    case 14:
      *pin = GPIO_PIN_14;
      break;

    case 15:
      *pin = GPIO_PIN_15;
      break;

    default:
      usb_printf(CMD_KO "unknown pin number: %d\n\r",number);
      return -1;
      break;
  }

  return 0;
}

int is_reserved(uint8_t name[GPIO_NAME_LEN])
{
  return 0;
  int r=0;

  while(RESERVED_PIN[r][0] != '\0')
  {
    if(strncmp((const char *)name,&RESERVED_PIN[r][0],GPIO_NAME_LEN) == 0)
    {
      usb_printf(CMD_KO "%s is an reserver pin\n\r",RESERVED_PIN[r]);
      return -1;
    }

    r++;
  }

  return 0;
}


int get_mode(uint8_t modeTxt[GPIO_MODE_LEN],uint32_t *mode)
{
  if(strncmp((const char *)modeTxt,MODE_INPUT,GPIO_MODE_LEN) == 0)
  {
    *mode = GPIO_MODE_INPUT;
    return 0;
  }
  else if(strncmp((const char *)modeTxt,MODE_OUTPUT_PP,GPIO_MODE_LEN) == 0)
  {
    *mode = GPIO_MODE_OUTPUT_PP;
    return 0;
  }
  else if(strncmp((const char *)modeTxt,MODE_OUTPUT_OD,GPIO_MODE_LEN) == 0)
  {
    *mode = GPIO_MODE_OUTPUT_OD;
    return 0;
  }
  else if(strncmp((const char *)modeTxt,MODE_INPUT_ADC,GPIO_MODE_LEN) == 0)
  {
    *mode = GPIO_MODE_ANALOG;
    return 0;
  }

  usb_printf(CMD_KO "unknown mode : %s\n\r",modeTxt);
  return -1;
}

int get_pull(uint8_t pullTxt[GPIO_PULL_LEN],uint32_t *pull)
{
  if(strncmp((const char *)pullTxt,NOPULL,GPIO_PULL_LEN) == 0)
  {
    *pull = GPIO_NOPULL;
    return 0;
  }
  else if(strncmp((const char *)pullTxt,PULLUP,GPIO_PULL_LEN) == 0)
  {
    *pull = GPIO_PULLUP;
    return 0;
  }
  else if(strncmp((const char *)pullTxt,PULLDOWN,GPIO_PULL_LEN) == 0)
  {
    *pull = GPIO_PULLDOWN;
    return 0;
  }

  usb_printf(CMD_KO "unknown pull : %s\n\r",pullTxt);
  return -1;
}


int cmd_uid(uint8_t* cmd,uint8_t len)
{
  UNUSED(cmd);
  UNUSED(len);
  char *id = (char *)UID_BASE;
  char txt[12*2+2];
  int i=0;

  for(; i< 12 ; i++)
  {
    sprintf(&txt[i*2],"%02X",*id++);
  }

  txt[i*2]= '\0';
  usb_printf(CMD_OK "value :%s\n\r",txt);
  return 0;
}

int get_config_index(const uint8_t name[4])
{
  uint16_t i=0;

  while(config.gpio[i].name[0] != '\0')
  {
    if(strncmp((const char *)&config.gpio[i].name[0],(const char *)name,4) == 0)
    {
      return i;
    }

    i++;
  }

  return -1;
}

uint32_t get_adc_channel(const uint8_t name[4])
{
  uint16_t i=0;

  while(adc_chanel[i].name[0] != '\0')
  {
    if(strncmp((const char *)&adc_chanel[i].name[0],(const char *)name,4) == 0)
    {
      return adc_chanel[i].channel;
    }

    i++;
  }

  return 0;
}

int update_config_value(const uint8_t name[4],uint8_t state)
{
  int index = get_config_index(name);

  if(index <0)
  {
    return -1;
  }

  config.gpio[index].state = state;
  return 0;
}

int update_config_setting(const uint8_t name[4], uint8_t mode,uint8_t pull)
{
  int index = get_config_index(name);

  if(index <0)
  {
    return -1;
  }

  config.gpio[index].mode = mode;
  config.gpio[index].pull = pull;
  return 0;
}


const char *get_mode_txt(uint32_t mode)
{
  switch(mode)
  {
    case GPIO_MODE_INPUT:
      return MODE_INPUT;

    case GPIO_MODE_ANALOG:
      return MODE_INPUT_ADC;

    case GPIO_MODE_OUTPUT_PP:
      return MODE_OUTPUT_PP;

    case GPIO_MODE_OUTPUT_OD:
      return MODE_OUTPUT_OD;

    default:
      return "UNK";
  }
}

const char *get_pull_txt(uint32_t pull)
{
  switch(pull)
  {
    case GPIO_NOPULL:
      return NOPULL;

    case GPIO_PULLUP:
      return PULLUP;

    case GPIO_PULLDOWN:
      return PULLDOWN;

    default:
      return "UNK";
  }
}

int cmd_dump_config(uint8_t* cmd,uint8_t len)
{
  UNUSED(cmd);
  UNUSED(len);
  usb_printf("CONFIG SIZE: %d\n\r",sizeof(config));
  usb_printf("SYS NAME: %s\n\r",config.sys_name);
  uint16_t i=0;

  while(config.gpio[i].name[0] != '\0')
  {
    GPIO_TypeDef *port=0;
    uint32_t pin=0 ;
    int32_t value=-1;

    if(get_port_and_pin(config.gpio[i].name,&port,&pin) ==0)
    {
      value = gpio_read_pin(port, pin);
    }

    usb_printf("%s %s %s %d %d\n\r",
               config.gpio[i].name,
               get_mode_txt(config.gpio[i].mode),
               get_pull_txt(config.gpio[i].pull),
               config.gpio[i].state,
               value
              );
    i++;
  }

  usb_printf(CMD_OK "\n\r");
  return 0;
}

#define CONFIGUATION_ADDRESS  (FLASH_BASE_ADDRESS+ 256*1024 - FLASH_PAGE_SIZE)

int load_config()
{
  uint16_t i=0;
  config_st *config_flash  = (config_st *)CONFIGUATION_ADDRESS;

  if(config_flash->sys_name[0] != 0xFF && memcmp(&config_flash->integrity_name[0], &default_config.integrity_name[0], sizeof(default_config.integrity_name)) == 0)
  {
    usb_printf("use flash config\n\r");
    memcpy(&config,(void*)config_flash,sizeof(config));
  }
  else
  {
    usb_printf("use default config\n\r");
    memcpy(&config,&default_config,sizeof(config));
  }

  GPIO_TypeDef *port=0;
  uint32_t pin=0 ;

  while(config.gpio[i].name[0] != '\0')
  {
    usb_printf("%s %s %s\n\r",config.gpio[i].name, get_mode_txt(config.gpio[i].mode), get_pull_txt(config.gpio[i].pull));

    if(get_port_and_pin(config.gpio[i].name,&port,&pin) == 0)
    {
      if(gpio_init(port,pin,config.gpio[i].mode,config.gpio[i].pull) == 0)
      {
        if(config.gpio[i].mode != GPIO_MODE_INPUT)
        {
          gpio_write_pin(port, pin, config.gpio[i].state);
        }
      }
    }

    i++;
  }

  return 0;
}

int cmd_save_config(uint8_t* cmd,uint8_t len)
{
  UNUSED(cmd);
  UNUSED(len);

  if(memcmp((void*)CONFIGUATION_ADDRESS,(void*)&config,sizeof(config)) == 0)
  {
    usb_printf(CMD_OK "is uptodate\n\r");
    return 0;
  }

