m-gardet/STM32F3DISCOVERY/Src/command.c
  if(flash_Update(CONFIGUATION_ADDRESS, (const uint8_t *)&config, sizeof(config)) != 0)
  {
    usb_printf(CMD_KO "flash Update error\n\r");
    return -1;
  }

  usb_printf(CMD_OK "\n\r");
  return 0;
}

int cmd_default_config(uint8_t* cmd,uint8_t len)
{
  memcpy(&config,&default_config,sizeof(config));
  return cmd_save_config(cmd,len);
}

int cmd_init(uint8_t* cmd,uint8_t  len)
{
  UNUSED(len);
  uint8_t* arg= cmd;
  arg+= (GPIO_INIT_NAME_LEN+1);
  GPIO_TypeDef *GPIOx=0;
  uint32_t pin=0;

  if(get_port_and_pin(arg,&GPIOx,&pin) !=0)
    return -1;

  if(is_reserved(arg) !=0)
    return -1;

  uint32_t mode;
  arg+= (GPIO_NAME_LEN+1);

  if(get_mode(arg,&mode) != 0)
    return -1;

  uint32_t pull;
  arg+= (GPIO_MODE_LEN+1);

  if(get_pull(arg,&pull) != 0)
    return -1;

  if(gpio_init(GPIOx,pin,mode,pull) != 0)
  {
    usb_printf(CMD_KO " gpio_init \n\r");
    return-1;
  }

  update_config_setting(&cmd[(GPIO_INIT_NAME_LEN+1)], mode,pull);
  usb_printf(CMD_OK "\n\r");
  return 0;
}


int cmd_set(uint8_t* cmd,uint8_t len)
{
  UNUSED(len);
  uint8_t* arg= cmd;
  arg+= (GPIO_SET_NAME_LEN+1);
  GPIO_TypeDef *GPIOx=0;
  uint32_t pin=0;

  if(get_port_and_pin(arg,&GPIOx,&pin) !=0)
    return -1;

  int index = get_config_index(arg);

  if(index < 0)
  {
    usb_printf(CMD_KO " configuration index not found for cmd %s\n\r",cmd);
    return -1;
  }

  if(config.gpio[index].mode != GPIO_MODE_OUTPUT_PP && config.gpio[index].mode != GPIO_MODE_OUTPUT_OD)
  {
    usb_printf(CMD_KO " this pin is not an ouput %s => cmd %s\n\r", get_mode_txt(config.gpio[index].mode), cmd);
    return -1;
  }

  arg+= (GPIO_NAME_LEN+1);
  uint32_t value =0;

  if(arg[0] == '0')
    value = GPIO_PIN_RESET;
  else if(arg[0] == '1')
    value = GPIO_PIN_SET;
  else
  {
    usb_printf(CMD_KO "unknown value : %s\n\r",arg);
    return -1;
  }

  if(gpio_write_pin(GPIOx, pin, value) != 0)
  {
    usb_printf(CMD_KO " gpio_write_pin \n\r");
    return -1;
  }

  update_config_value(&cmd[(GPIO_SET_NAME_LEN+1)],value);
  usb_printf(CMD_OK "\n\r");
  return 0;
}

int cmd_get(uint8_t* cmd,uint8_t  len)
{
  UNUSED(len);
  uint8_t* arg= cmd;
  arg+= (GPIO_GET_NAME_LEN+1);
  GPIO_TypeDef *GPIOx=0;
  uint32_t pin=0;

  if(get_port_and_pin(arg,&GPIOx,&pin) !=0)
    return -1;

  int index = get_config_index(arg);

  if(index < 0)
  {
    usb_printf(CMD_KO " configuration index not found for cmd %s\n\r",cmd);
    return -1;
  }

  if(config.gpio[index].mode == GPIO_MODE_ANALOG)
  {
    uint32_t channel = get_adc_channel(arg);

    if(channel == 0)
    {
      usb_printf(CMD_KO " adc channel not found for cmd %s\n\r",cmd);
      return -1;
    }

    int32_t value = adc_read(channel);

    if(value < 0)
    {
      usb_printf(CMD_KO " adc read error %s\n\r",cmd);
      return -1;
    }

    usb_printf(CMD_OK "value :%d\n\r",value);
  }
  else
  {
    uint32_t value = gpio_read_pin(GPIOx, pin);
    usb_printf(CMD_OK "value :%d\n\r",value);
  }

  return 0;
}



int cmd_set_sys_nanme(uint8_t* cmd,uint8_t len)
{
  uint8_t* arg= cmd;
  arg+= (SET_SYS_NAME_LEN+1);
  uint8_t l=len - (SET_SYS_NAME_LEN+1);

  if(l >= (sizeof(config.sys_name) -1))
    l = sizeof(config.sys_name) -1;

  memcpy(config.sys_name,arg,l);
  config.sys_name[l] = '\0';
  usb_printf(CMD_OK "\n\r");
  return 0;
}

int cmd_get_sys_nanme(uint8_t* cmd,uint8_t len)
{
  UNUSED(cmd);
  UNUSED(len);
  usb_printf(CMD_OK "value :%s\n\r",config.sys_name);
  return 0;
}

typedef int (*parsing_function)(uint8_t* cmd,uint8_t  len);

typedef struct
{
  uint8_t len_total;
  uint8_t len_name;
  const char * name;
  parsing_function func;
} cmd_st;


cmd_st cmd_list[] =
{
  { HELP_NAME_LEN       , HELP_NAME_LEN    ,  HELP_NAME         , help },
  { GET_UID_NAME_LEN    , GET_UID_NAME_LEN ,  GET_UID_NAME      , cmd_uid },
  { UNKNOWN_TOTAL_LEN   , SET_SYS_NAME_LEN ,  SET_SYS_NAME_NAME , cmd_set_sys_nanme  },
  { GET_SYS_NAME_LEN    , GET_SYS_NAME_LEN ,  GET_SYS_NAME_NAME , cmd_get_sys_nanme  },

  { SAVE_CONFIG_NAME_LEN   , SAVE_CONFIG_NAME_LEN   , SAVE_CONFIG_NAME   , cmd_save_config },
  { DUMP_CONFIG_NAME_LEN   , DUMP_CONFIG_NAME_LEN   , DUMP_CONFIG_NAME   , cmd_dump_config },
  { DEFAULT_CONFIG_NAME_LEN, DEFAULT_CONFIG_NAME_LEN, DEFAULT_CONFIG_NAME, cmd_default_config },

  { GPIO_INIT_TOTAL_LEN, GPIO_INIT_NAME_LEN,  GPIO_INIT_NAME, cmd_init },
  { GPIO_SET_TOTAL_LEN , GPIO_SET_NAME_LEN ,  GPIO_SET_NAME , cmd_set  },
  { GPIO_GET_TOTAL_LEN , GPIO_GET_NAME_LEN ,  GPIO_GET_NAME , cmd_get  },

  // end of list
  {0 ,0,"", NULL }
};


void cmd_parsing(uint8_t* cmd,uint8_t  len)
{
  if(len >= HELP_NAME_LEN)
  {
    uint16_t index =0;

    while(cmd_list[index].len_total != 0)
    {
      if((len ==  cmd_list[index].len_total  ||  cmd_list[index].len_total == UNKNOWN_TOTAL_LEN) && (strncmp((const char *)cmd,cmd_list[index].name,cmd_list[index].len_name) == 0))
      {
        cmd_list[index].func(cmd,len);
        return;
      }

      index++;
    }
  }

  usb_printf(CMD_KO "Invalid command: %s (%d bytes) try HELP\n\r",cmd,len);
}

void cmd_config()
{
  osMsgQueue = osMessageCreate(osMessageQ(osMsgQueue), NULL);
  memset(usbQueue,0,sizeof(message_t)*USB_QUEUE_SIZE);
}

void new_data_it(uint8_t* buf, uint32_t *len)
{
  for(uint32_t i=0; i< *len  ; i++)
  {
    usbQueue[queueIndex].buffer[usbQueue[queueIndex].len] = buf[i];

    if(usbQueue[queueIndex].buffer[usbQueue[queueIndex].len] == '\r')
    {
      usbQueue[queueIndex].buffer[usbQueue[queueIndex].len] = '\0';
      osMessagePut(osMsgQueue, (uint32_t)&usbQueue[queueIndex], 0);
      queueIndex++;

      if(queueIndex >= (USB_QUEUE_SIZE))
        queueIndex=0;

      usbQueue[queueIndex].len=0;
    }
    else
    {
      if(usbQueue[queueIndex].len < (BUFFER_SIZE-1))
        usbQueue[queueIndex].len++;
    }
  }
}

void cmd_loop()
{
  osDelay(100);
  gpio_init(LED_PORT,LED_PIN,GPIO_MODE_OUTPUT_PP,GPIO_NOPULL);
  load_config();
  uint32_t i=0;
  #ifndef   _DEBUG
  MX_IWDG_Init();
  #endif

  for(;;)
  {
    osEvent evt = osMessageGet(osMsgQueue, OS_WAITE_TIMEOUT);
    #ifndef   _DEBUG
    MX_IWDG_Refresh();
    #endif
    i++;

    if(evt.status != osEventMessage)
    {
      //usb_printf("loop %08d  returned 0x%02x status\n\r",i, evt.status);
    }
    else
    {
      message_t *usbMsg = (message_t *)evt.value.v;
      cmd_parsing(usbMsg->buffer, usbMsg->len);
    }

    if(i%2)
      led_on();
    else
      led_off();
  }
}

